app/controllers/artists_controller.rb

SELECT * FROM "artists"
---
  def index
    @artists = Artist.all.paginate :per_page => 50, :page => params[:page]

SELECT "users".id FROM "users" WHERE ("users"."twitter_id" = 19149665) LIMIT 1
INSERT INTO "users" ("updated_at", "username", "twitter_id", "created_at") VALUES('2009-08-14 18:21:26', 'VicGatsby', 2933526, '2009-08-14 18:21:26')
INSERT INTO "tweets" ("status", "artist_id", "updated_at", "twitter_id", "user_id", "posted_at", "created_at") VALUES('&quot;the funky fresh is back in effect with a vengeance homes!&quot;', 7, '2009-08-14 18:21:26', 3312428322, 1, '2009-08-14 18:12:08', '2009-08-14 18:21:26')
SELECT * FROM "tweets" WHERE ("tweets".artist_id = 7) ORDER BY posted_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "tweets" WHERE ("tweets".artist_id = 7)
---
  def show
    grackle = Grackle::Client.new(:api => :search)
    results = grackle.search.json(:q => "\"#{@artist.name}\"+-RT-via", :rpp => 100, :since_id => (@artist.last_search_id || nil)).results
    for result in results
      unless user = User.find_by_twitter_id(result.from_user_id)
        user = User.new(:username => result.from_user, :twitter_id => result.from_user_id)
        user.save
      end
      tweet = Tweet.new(:artist_id => @artist.id, :user_id => user.id, :status => result.text, :twitter_id => result.id, :posted_at => result.created_at)
      tweet.save
    end
    # FIXME: "Called id for nil, which would mistakenly be 4 -- if you really wanted the id of nil, use object_id"
    # @artist.last_search_id = results.first.id unless params[:page]
    @artist.save
    @results = @artist.tweets.paginate :per_page => 10, :page => params[:page]

INSERT INTO "artists" ("name", "permalink", "updated_at", "last_search_id", "created_at") VALUES('Linkin Park', 'linkinpark', '2009-08-14 05:12:25', NULL, '2009-08-14 05:12:25')
SELECT * FROM "artists"
---
  def create
    @artist = Artist.new(params[:artist])

    if @artist.save
      redirect_to @artist
    else
      @artists = Artist.all

DELETE FROM "artists" WHERE "id" = 3
---
  def destroy
    @artist.destroy

SELECT * FROM "artists" WHERE ("artists"."permalink" = 'wil-shipley') LIMIT 1
---
  def find_artist
    @artist = Artist.find_by_permalink(params[:id]) if params[:id]